In [1]:
import pandas as pd

In [2]:
df_2008 = pd.read_csv('ath_2008.csv')

In [3]:
df_2012 = pd.read_csv('ath_2012.csv')

In [5]:

df_2008.loc[df_2008.Athlete == 'BOLT, Usain']

        Athlete  Gold  Silver  Bronze
12  BOLT, Usain     3       0       0

In [6]:
df_2012.loc[df_2012.Athlete == 'BOLT, Usain']

        Athlete  Gold  Silver  Bronze
14  BOLT, Usain     3       0       0

In [7]:

df_full = df_2008.merge(df_2012, how='outer', on='Athlete', suffixes=["_2008", "_2012"], indicator=True)

In [9]:
# Procurando Um Nome no Merge dos DFs:

df_full.loc[df_full.Athlete == 'BOLT, Usain']

,Athlete,Gold_2008,Silver_2008,Bronze_2008,Gold_2012,Silver_2012,Bronze_2012,_merge
12,"BOLT, Usain",3.0,0.0,0.0,3.0,0.0,0.0,both

In [25]:
# Esta é a forma de Buscar em várias colunas -> on=['col1','col2'....]


df_full = df_2008.merge(df_2012, how='outer', on=['Athlete', "Silver","Bronze"], suffixes=["_2008", "_2012"], indicator=True)


df_full.loc[df_full.Athlete == 'BOLT, Usain']

        Athlete  Gold_2008  Silver  Bronze  Gold_2012 _merge
12  BOLT, Usain        3.0       0       0        3.0   both

In [23]:
df_full.loc[df_full.Athlete == 'SALADUKHA, Olga']

,Athlete,Gold_2008,Silver_2008,Bronze,Gold_2012,Silver_2012,_merge
275,"SALADUKHA, Olga",NaN,NaN,1,0.0,0.0,right_only

In [26]:
df_full.loc[df_full.Athlete == 'ALEKNA, Virgilijus']

              Athlete  Gold_2008  Silver  Bronze  Gold_2012     _merge
2  ALEKNA, Virgilijus        0.0       0       1        NaN  left_only